src/cf/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыФинансовыхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыФинансовыхОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныйПоток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Баланс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектовИерархия</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>17</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык1</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык2</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиДополнительныхРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗависимоеСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыВыбораЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/Catalogs/Проекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	НаборСвойств_Справочник_Проекты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Проекты");
	// Конец СтандартныеПодсистемы.Свойства
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ВосстановитьНастройкиФормы();
	
	ДоступныДоходыИРасходы = ПравоДоступа("Просмотр", Метаданные.Отчеты.ДоходыИРасходы)
							И ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ДоходыИРасходы);
	ДоступенДенежныйПоток = ПравоДоступа("Просмотр", Метаданные.Отчеты.ДвижениеДенежныхСредствПоПроектам)
							И ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ДвиженияДенежныхСредств); 
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Если ДоступныДоходыИРасходы ИЛИ ДоступенДенежныйПоток Тогда 	
		Если Не ДоступныДоходыИРасходы Тогда
			Элементы.ВидФинансовогоОтчета.Видимость = Ложь;
			ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток;
			СохранитьНастройкиФормы(ВидФинансовогоОтчета);
		КонецЕсли;
		
		Если Не ДоступенДенежныйПоток Тогда
			Элементы.ВидФинансовогоОтчета.Видимость = Ложь;
			ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы;
			СохранитьНастройкиФормы(ВидФинансовогоОтчета);
		КонецЕсли;
		
		Если Объект.Ссылка.Пустая() Тогда
			Элементы.ГруппаОжиданиеГистограммы.Видимость = Ложь;
			Элементы.ГруппаОжиданиеКольцевой.Видимость = Ложь;
			Элементы.ДополнительнаяИнформация.Видимость = Ложь;
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток);
		Иначе
			РезультатФоновогоЗадания = ЗапуститьФоновоеЗадание();
		КонецЕсли;
	Иначе
		Элементы.ВидФинансовогоОтчета.Видимость = Ложь;
		Элементы.ДополнительнаяИнформация.Видимость = Ложь;
		Элементы.Отступ.Видимость = Ложь;
		Элементы.ГруппаДиаграммы.Видимость = Ложь;
	КонецЕсли;
	
	Если ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаДиаграммы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ДекорацияМеждуДатами.Видимость = Ложь;
		Элементы.Комментарий.Высота = 3;
		Элементы.ГруппаРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ДополнительнаяИнформация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	БылаПерестроенаКольцеваяДиаграммаДР = Ложь;
	БылаПерестроенаКольцеваяДиаграммаДП = Ложь;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ОбновитьВидимостьЭлементов();
	Если ДоступныДоходыИРасходы ИЛИ ДоступенДенежныйПоток Тогда
		ПроверитьФоновоеЗадание();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Справочник_Проекты);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СтруктураДанных = ПолучитьДанныеКонтрагентПриИзменении(Объект.Контрагент);
	Объект.Договор = СтруктураДанных.Договор;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)	
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
		Период = СписокДатИзГистограммыДР.НайтиПоЗначению(ЗначениеДиаграммы.Точка.Значение); 
		ТипПериода = ТипПериодаДР;
	Иначе            
        Период = СписокДатИзГистограммыДП.НайтиПоЗначению(ЗначениеДиаграммы.Точка.Значение); 
		ТипПериода = ТипПериодаДП;
	КонецЕсли;
	
	Если ТипПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ПерестроитьГистограммуКМесяцам(Период.Значение, Ложь);
	ИначеЕсли ТипПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ПерестроитьГистограммуКМесяцам(Период.Значение, Истина);
	Иначе
		ПерестроитьКольцевуюДиаграмму(Период.Значение, ЗначениеДиаграммы.Серия.Значение);
		Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
			СписокДатИзГистограммыДР.Добавить(Период.Значение, Период.Представление);
		Иначе            
	        СписокДатИзГистограммыДП.Добавить(Период.Значение, Период.Представление);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДиаграммыНажатие(Элемент)
		
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		Гистограмма = ГистограммаДР;
		АктивнаяТаблица = ДоходыИРасходы;
		БылаПерестроенаКольцеваяДиаграмма = БылаПерестроенаКольцеваяДиаграммаДР;
	Иначе
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		Гистограмма = ГистограммаДП; 
		АктивнаяТаблица = ДенежныйПоток; 
		БылаПерестроенаКольцеваяДиаграмма = БылаПерестроенаКольцеваяДиаграммаДП;
	КонецЕсли;
	
	Если АктивнаяТаблица.Количество() < 1 Тогда
		Возврат;
	КонецЕсли;
	
	КольцеваяДиаграмма.Очистить();
	Гистограмма.Очистить();
	Если БылаПерестроенаКольцеваяДиаграмма Тогда
		КольцеваяДиаграмма.ОбластьЗаголовка.Верх = 0.99;
		КольцеваяДиаграмма.ОбластьЗаголовка.Лево = 0.42;
	КонецЕсли; 
	
	ЗаполнитьДиаграммы(ВидФинансовогоОтчета, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();
	 
КонецПроцедуры

&НаКлиенте
Процедура ПрибыльУбытокОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура РасходОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура РентабельностьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();

КонецПроцедуры

&НаКлиенте
Процедура ВыбытияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧистыйДенежныйПотокОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПерейтиКОтчету();	

КонецПроцедуры

&НаКлиенте
Процедура ВидФинансовогоОтчетаПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов(); 
	СохранитьНастройкиФормы(ВидФинансовогоОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
		Элементы.ГистограммаДР.Видимость = Истина;
		Элементы.КольцеваяДиаграммаДР.Видимость = Истина; 
		Элементы.ДополнительнаяИнформация.Видимость = Истина;
		
		Элементы.ГистограммаДП.Видимость = Ложь;
		Элементы.КольцеваяДиаграммаДП.Видимость = Ложь; 
		Элементы.ДополнительнаяИнформацияДенежныйПоток.Видимость = Ложь;
	Иначе
		Элементы.ГистограммаДР.Видимость = Ложь;
		Элементы.КольцеваяДиаграммаДР.Видимость = Ложь;
		Элементы.ДополнительнаяИнформация.Видимость = Ложь;
		
		Элементы.ГистограммаДП.Видимость = Истина;
		Элементы.КольцеваяДиаграммаДП.Видимость = Истина;
		Элементы.ДополнительнаяИнформацияДенежныйПоток.Видимость = Истина;
	КонецЕсли; 	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормы(ВидФинансовогоОтчета)
	
	НастройкиФормы = Справочники.Проекты.ИнициализироватьНастройкиФормы();
	НастройкиФормы.ВидФинансовогоОтчета = ВидФинансовогоОтчета; 
		
	Справочники.Проекты.СохранитьНастройкиФормы(НастройкиФормы);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	НастройкиФормы = Справочники.Проекты.ИнициализироватьНастройкиФормы();
	Справочники.Проекты.ВосстановитьНастройкиФормы(НастройкиФормы);
	
	ВидФинансовогоОтчета = НастройкиФормы.ВидФинансовогоОтчета;
	
КонецПроцедуры

// Функция готовит и возвращает структуру с данными контрагента
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтрагентПриИзменении(Контрагент)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Договор", Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент));
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьФоновоеЗадание()
	
	Если РезультатФоновогоЗадания <> Неопределено Тогда
		Если РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
			Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект);
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания,Обработчик,ПараметрыОжидания);
		ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
			Элементы.ГруппаОжиданиеГистограммы.Видимость = Ложь;
			Элементы.ГруппаОжиданиеКольцевой.Видимость = Ложь;
			ЗаполнитьДанныеТаблиц(РезультатФоновогоЗадания.АдресРезультата);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗадание()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДатаНачала = НачалоМесяца(ПолучитьДатуНачала(Объект.ДатаНачала));
	ДатаОкончания = ПолучитьДатуОкончания(Объект.ДатаОкончания,ТекущаяДатаСеанса());
	
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"Справочники.Проекты.ОбъединитьРезультаты",
		Объект.Ссылка,ДатаНачала,ДатаОкончания,ДоступныДоходыИРасходы, ДоступенДенежныйПоток);
	
	Возврат РезультатДлительнойОперации;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		Элементы.ГруппаОжиданиеГистограммы.Видимость = Ложь;
		Элементы.ГруппаОжиданиеКольцевой.Видимость = Ложь;
		ЗаполнитьДанныеТаблиц(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТаблиц(АдресРезультата)
	
	ТаблицыСАналитикой = ПолучитьИзВременногоХранилища(АдресРезультата);

	Если ТаблицыСАналитикой.Свойство("ДоходыИРасходы") Тогда	
		ДоходыИРасходы.Загрузить(ТаблицыСАналитикой.ДоходыИРасходы); 
		
		СуммаДоходов = ДоходыИРасходы.Итог("Доход");
		СуммаРасходов = ДоходыИРасходы.Итог("Расход");
		Элементы.Доход.Заголовок = ФорматированныйДоходИлиРасход(СуммаДоходов, Истина);
		Элементы.Расход.Заголовок = ФорматированныйДоходИлиРасход(СуммаРасходов, Ложь);
		Элементы.ПрибыльУбыток.Заголовок = ФорматированнаяПрибыльИлиУбыток(СуммаДоходов, СуммаРасходов);
		Элементы.Рентабельность.Заголовок = ФорматированнаяРентабельность(СуммаДоходов, СуммаРасходов);
		
		Если ЗначениеЗаполнено(ДоходыИРасходы) Тогда
			ЗаполнитьДиаграммы(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы, Истина);
		Иначе
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы);
		КонецЕсли;
	КонецЕсли; 
	
	Если ТаблицыСАналитикой.Свойство("ДенежныйПоток") Тогда	
		ДенежныйПоток.Загрузить(ТаблицыСАналитикой.ДенежныйПоток);
		
		СуммаДоходов = ДенежныйПоток.Итог("Доход");
		СуммаРасходов = ДенежныйПоток.Итог("Расход");
		Элементы.Поступления.Заголовок = ФорматированныеПоступленияИлиВыбытия(СуммаДоходов, Истина);
		Элементы.Выбытия.Заголовок = ФорматированныеПоступленияИлиВыбытия(СуммаРасходов, Ложь);
		Элементы.ЧистыйДенежныйПоток.Заголовок = ФорматированныйЧистыйДенежныйПоток(СуммаДоходов, СуммаРасходов); 
		
		Если ЗначениеЗаполнено(ДенежныйПоток) Тогда
			ЗаполнитьДиаграммы(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток, Истина);
		Иначе
			ЗаполнитьДиаграммыТестовымиЗначениями(Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток); 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммы(ВидФинансовогоОтчета, ОбновитьГраницыЗаголовка)  
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		Гистограмма = ГистограммаДР;
		ДанныеТаблицы = ДоходыИРасходы.Выгрузить();
		СписокДатИзГистограммы = СписокДатИзГистограммыДР;
	Иначе
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		Гистограмма = ГистограммаДП;  
		ДанныеТаблицы = ДенежныйПоток.Выгрузить();
		СписокДатИзГистограммы = СписокДатИзГистограммыДП;
	КонецЕсли;
	
	СписокДатИзГистограммы.Очистить();
	МаксЗначениеШкалы = 0;
	СерияДоходы = Гистограмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	СерияДоходы.Цвет = ЦветаСтиля.ЦветДоходаВПроекте;
	СерияРасходы = Гистограмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	СерияРасходы.Цвет = ЦветаСтиля.ЦветРасходаВПроекте;
	КольцеваяДиаграмма.ОтображатьЛегенду = Ложь;
	КольцеваяДиаграмма.ОбластьЗаголовка.Текст = ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета);
	Если ОбновитьГраницыЗаголовка Тогда
		КольцеваяДиаграмма.ОбластьЗаголовка.Верх = 0.32;
		КольцеваяДиаграмма.ОбластьЗаголовка.Лево = 0.42;
	КонецЕсли;
	
	ДатаНачала = ПолучитьДатуНачала(Объект.ДатаНачала, ДанныеТаблицы);
	ДатаОкончания = ПолучитьДатуОкончания(Объект.ДатаОкончания, ТекущаяДатаСеанса(), ДанныеТаблицы);
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Если КоличествоМесяцевМеждуДатами(ДатаНачала, ДатаОкончания) <= 12 Тогда
			Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
				Точка = Гистограмма.УстановитьТочку(ДатаНачала);
				Точка.Текст = ФорматированнаяДатаПоМесяцу(ДатаНачала);
				СписокДатИзГистограммы.Добавить(Точка.Значение, Точка.Текст);
				Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
				ДатаНачала = ДобавитьМесяц(ДатаНачала,1);
				Если Результат.МаксимальноеЗначение > МаксЗначениеШкалы Тогда
					МаксЗначениеШкалы = Результат.МаксимальноеЗначение;
				КонецЕсли;
				Гистограмма.УстановитьЗначение(Точка, СерияДоходы,Результат.Доход);
				Гистограмма.УстановитьЗначение(Точка, СерияРасходы,Результат.Расход);
			КонецЦикла;
			ТипПериода = Перечисления.Периодичность.Месяц;
		ИначеЕсли КоличествоМесяцевМеждуДатами(ДатаНачала, ДатаОкончания) <= 36 Тогда
			Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
				ТекКвартал = ФорматированнаяДатаПоКварталу(ДатаНачала);
				СписокДатИзГистограммы.Добавить(ДатаНачала, ТекКвартал);
				Точка = Гистограмма.УстановитьТочку(ДатаНачала);
				Точка.Текст = ФорматированнаяДатаПоКварталу(ТекКвартал);
				ДоходПоКварталу = 0;
				РасходПоКварталу = 0;
				Пока ФорматированнаяДатаПоКварталу(ДатаНачала) = ТекКвартал Цикл
					Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
					ДоходПоКварталу = ДоходПоКварталу + Результат.Доход;
					РасходПоКварталу = РасходПоКварталу + Результат.Расход;
					Если Макс(ДоходПоКварталу, РасходПоКварталу) > МаксЗначениеШкалы Тогда
						МаксЗначениеШкалы = Макс(ДоходПоКварталу, РасходПоКварталу);
					КонецЕсли;
					Если НачалоМесяца(ДатаНачала) > ДатаОкончания Тогда
						Прервать;
					КонецЕсли;
					ДатаНачала = ДобавитьМесяц(ДатаНачала, 1);
				КонецЦикла;
				Гистограмма.УстановитьЗначение(Точка, СерияДоходы, ДоходПоКварталу);
				Гистограмма.УстановитьЗначение(Точка, СерияРасходы, РасходПоКварталу);
			КонецЦикла;
			ТипПериода = Перечисления.Периодичность.Квартал;
		Иначе
			Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
				ТекГод = ФорматированнаяДатаПоГоду(ДатаНачала);
				Точка = Гистограмма.УстановитьТочку(ДатаНачала);
				Точка.Текст = ТекГод;
				СписокДатИзГистограммы.Добавить(ДатаНачала, ТекГод);
				ДоходПоГоду = 0;
				РасходПоГоду = 0;
				Пока ФорматированнаяДатаПоГоду(ДатаНачала) = ТекГод Цикл
					Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
					ДоходПоГоду = ДоходПоГоду + Результат.Доход;
					РасходПоГоду = РасходПоГоду + Результат.Расход;
					Если Макс(ДоходПоГоду, РасходПоГоду) > МаксЗначениеШкалы Тогда
						МаксЗначениеШкалы = Макс(ДоходПоГоду, РасходПоГоду);
					КонецЕсли;
					Если НачалоМесяца(ДатаНачала) > ДатаОкончания Тогда
						Прервать;
					КонецЕсли;
					ДатаНачала = ДобавитьМесяц(ДатаНачала, 1);
				КонецЦикла;
				Гистограмма.УстановитьЗначение(Точка, СерияДоходы, ДоходПоГоду);
				Гистограмма.УстановитьЗначение(Точка, СерияРасходы, РасходПоГоду);
			КонецЦикла;
			ТипПериода = Перечисления.Периодичность.Год;
		КонецЕсли;
	КонецЕсли;
	СуммаДоходов = ДанныеТаблицы.Итог("Доход");
	СуммаРасходов = ДанныеТаблицы.Итог("Расход");
	
	Гистограмма.ОсьЗначений.МаксимальноеЗначение = МаксЗначениеШкалы * 1.2;
	Гистограмма.ОсьЗначений.СпособОпределенияМаксимальногоЗначения = 
		СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	
	Точка = КольцеваяДиаграмма.УстановитьТочку("");
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветаСтиля.ЦветДоходаВПроекте;
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаДоходов);
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветаСтиля.ЦветРасходаВПроекте;
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаРасходов);
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		ТипПериодаДР = ТипПериода;
		
		Элементы.Доход.Заголовок = ФорматированныйДоходИлиРасход(СуммаДоходов, Истина);
		Элементы.Расход.Заголовок = ФорматированныйДоходИлиРасход(СуммаРасходов, Ложь);
		Элементы.ПрибыльУбыток.Заголовок = ФорматированнаяПрибыльИлиУбыток(СуммаДоходов, СуммаРасходов);
		Элементы.Рентабельность.Заголовок = ФорматированнаяРентабельность(СуммаДоходов, СуммаРасходов); 
	Иначе
		ТипПериодаДП = ТипПериода;
		
		Элементы.Поступления.Заголовок = ФорматированныеПоступленияИлиВыбытия(СуммаДоходов, Истина);
		Элементы.Выбытия.Заголовок = ФорматированныеПоступленияИлиВыбытия(СуммаРасходов, Ложь);
		Элементы.ЧистыйДенежныйПоток.Заголовок = ФорматированныйЧистыйДенежныйПоток(СуммаДоходов, СуммаРасходов); 
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		СписокДатИзГистограммы = СписокДатИзГистограммыДР;
		ДанныеТаблицы = ДоходыИРасходы.Выгрузить();
	Иначе
		СписокДатИзГистограммы = СписокДатИзГистограммыДП;
		ДанныеТаблицы = ДенежныйПоток.Выгрузить();
	КонецЕсли;	
	
	МаксПоПериоду = МаксЗначениеШкалы;
	ДоходПоПериоду = 0;
	РасходПоПериоду = 0;	
	СтрокиИзПериода = ДанныеТаблицы.НайтиСтроки(Новый Структура("Период", НачалоМесяца(ДатаНачала)));
	Если СтрокиИзПериода.Количество() > 0 Тогда
		Для Каждого СтрокаТЗ Из СтрокиИзПериода Цикл
			Если СтрокаТЗ.Доход > 0 И СтрокаТЗ.Расход > 0 Тогда
				ДоходПоПериоду = ДоходПоПериоду + СтрокаТЗ.Доход;
				РасходПоПериоду = РасходПоПериоду + СтрокаТЗ.Расход;
			ИначеЕсли СтрокаТЗ.Доход > 0 Тогда
				ДоходПоПериоду = ДоходПоПериоду + СтрокаТЗ.Доход;
			ИначеЕсли СтрокаТЗ.Расход > 0 Тогда
				РасходПоПериоду = РасходПоПериоду + СтрокаТЗ.Расход;
			КонецЕсли;
			Если Макс(ДоходПоПериоду, РасходПоПериоду) > МаксПоПериоду Тогда
				МаксПоПериоду = Макс(ДоходПоПериоду, РасходПоПериоду);
			КонецЕсли;
		КонецЦикла;
		СписокДатИзГистограммы.Добавить(НачалоМесяца(ДатаНачала), ФорматированнаяДатаПоМесяцу(ДатаНачала));
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("Доход", ДоходПоПериоду);
	Результат.Вставить("Расход", РасходПоПериоду);
	Результат.Вставить("МаксимальноеЗначение", МаксПоПериоду);
	Возврат Результат; 

КонецФункции

&НаСервере
Процедура ЗаполнитьДиаграммыТестовымиЗначениями(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		Элементы.ГистограммаДР.ТолькоПросмотр = Истина;
		Элементы.КольцеваяДиаграммаДР.ТолькоПросмотр = Истина; 
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		Гистограмма = ГистограммаДР;
	Иначе
		Элементы.ГистограммаДП.ТолькоПросмотр = Истина;
		Элементы.КольцеваяДиаграммаДП.ТолькоПросмотр = Истина;
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		Гистограмма = ГистограммаДП;
	КонецЕсли;   	
	
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел;
	СуммаДоходов = 0;
	СуммаРасходов = 0;
	
	КольцеваяДиаграмма.ОтображатьЛегенду = Ложь;
	КольцеваяДиаграмма.ОбластьЗаголовка.Текст = ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета);
	КольцеваяДиаграмма.ОбластьЗаголовка.Верх = 0.31;
	КольцеваяДиаграмма.ОбластьЗаголовка.Лево = 0.42;
	
	СерияДоходы = Гистограмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	СерияДоходы.Цвет = ЦветНетДанных(Ложь);
	СерияРасходы = Гистограмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	СерияРасходы.Цвет = ЦветНетДанных(Истина);
	ТекДата = НачалоГода(ТекущаяДатаСеанса());
	
	МассивМесяцев = Новый Массив;
	
	Для НомерМесяца = 0 По 11 Цикл
		СтрокаСМесяцем = СтрШаблон("%1 %2",Лев(Формат(ТекДата,"ДФ=ММММ"),3), Формат(ТекДата,"ДФ=гг"));
		МассивМесяцев.Добавить(СтрокаСМесяцем);
		ТекДата = ДобавитьМесяц(ТекДата,1);
	КонецЦикла;
	
	Для Каждого Месяц Из МассивМесяцев Цикл
		Точка = Гистограмма.УстановитьТочку(Месяц);
		Доход = ГенераторЧисел.СлучайноеЧисло(5000, 100000);
		Расход = ГенераторЧисел.СлучайноеЧисло(5000, 100000);
		СуммаДоходов = СуммаДоходов + Доход;
		СуммаРасходов = СуммаРасходов + Расход;
		Гистограмма.УстановитьЗначение(Точка, СерияДоходы, Доход);
		Гистограмма.УстановитьЗначение(Точка, СерияРасходы, Расход);
	КонецЦикла;
	
	Точка = КольцеваяДиаграмма.УстановитьТочку("");
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветНетДанных(Ложь);
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаДоходов);
	Серия = КольцеваяДиаграмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	Серия.Цвет = ЦветНетДанных(Истина);
	КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СуммаРасходов);
	
КонецПроцедуры    

&НаСервере
Процедура ПерестроитьКольцевуюДиаграмму(Период, ТипОборота)
	
	ДоходЗаПериод = 0;
	РасходЗаПериод = 0;
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		ДанныеТаблицы = ДоходыИРасходы.Выгрузить();
	Иначе
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;
		ДанныеТаблицы = ДенежныйПоток.Выгрузить();
	КонецЕсли;
		
	КольцеваяДиаграмма.Очистить();
	КольцеваяДиаграмма.ОтображатьЛегенду = Истина;
	КольцеваяДиаграмма.ОбластьЗаголовка.Текст = ВРег(Строка(ТипОборота));
	КольцеваяДиаграмма.ОбластьЗаголовка.Низ = 0.01;
	КольцеваяДиаграмма.ОбластьЗаголовка.Верх = 0.96;
	КольцеваяДиаграмма.ОбластьЗаголовка.Лево = 0.17;
	КольцеваяДиаграмма.ОбластьЗаголовка.Расположение = РасположениеОбластиЗаголовкаДиаграммы.УказываетсяРасположение;
	
	СтрокиИзПериода = ДанныеТаблицы.НайтиСтроки(Новый Структура("Период", НачалоМесяца(Период)));
	Точка = КольцеваяДиаграмма.УстановитьТочку("");
	Для Каждого СтрокаТЗ Из СтрокиИзПериода Цикл
		Если ТипОборота = ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета) Тогда
			Если СтрокаТЗ.Доход > 0 Тогда
				Серия = КольцеваяДиаграмма.УстановитьСерию(СтрокаТЗ.Статья);
				КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СтрокаТЗ.Доход);
			КонецЕсли;
		Иначе
			Если СтрокаТЗ.Расход > 0 Тогда
				Серия = КольцеваяДиаграмма.УстановитьСерию(СтрокаТЗ.Статья);
				КольцеваяДиаграмма.УстановитьЗначение(Точка,Серия,СтрокаТЗ.Расход);
			КонецЕсли;
		КонецЕсли;
		ДоходЗаПериод = ДоходЗаПериод + СтрокаТЗ.Доход;
		РасходЗаПериод = РасходЗаПериод + СтрокаТЗ.Расход;
	КонецЦикла;
	
	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		БылаПерестроенаКольцеваяДиаграммаДР = Истина;
		Элементы.Доход.Заголовок = ФорматированныйДоходИлиРасход(ДоходЗаПериод, Истина);
		Элементы.Расход.Заголовок = ФорматированныйДоходИлиРасход(РасходЗаПериод, Ложь);
		Элементы.ПрибыльУбыток.Заголовок = ФорматированнаяПрибыльИлиУбыток(ДоходЗаПериод, РасходЗаПериод);
		Элементы.Рентабельность.Заголовок = ФорматированнаяРентабельность(ДоходЗаПериод, РасходЗаПериод); 
	Иначе       
		БылаПерестроенаКольцеваяДиаграммаДП = Истина;
		Элементы.Поступления.Заголовок = ФорматированныеПоступленияИлиВыбытия(ДоходЗаПериод, Истина);
		Элементы.Выбытия.Заголовок = ФорматированныеПоступленияИлиВыбытия(РасходЗаПериод, Ложь);
		Элементы.ЧистыйДенежныйПоток.Заголовок = ФорматированныйЧистыйДенежныйПоток(ДоходЗаПериод, РасходЗаПериод); 
	КонецЕсли;
	
	Если ЭтоМобильныйКлиент Тогда
		КольцеваяДиаграмма.ОбластьЗаголовка.Лево = 0.42;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьГистограммуКМесяцам(Период, ЭтоГод)

	Если ВидФинансовогоОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		Гистограмма = ГистограммаДР;
		ТипПериодаДР = Перечисления.Периодичность.Месяц;
	Иначе
		Гистограмма = ГистограммаДП; 
		ТипПериодаДП = Перечисления.Периодичность.Месяц;
	КонецЕсли;
	
	МаксЗначениеШкалы = 0;
	
	Гистограмма.Очистить();
	СерияДоходы = Гистограмма.УстановитьСерию(ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета));
	СерияДоходы.Цвет = ЦветаСтиля.ЦветДоходаВПроекте;
	СерияРасходы = Гистограмма.УстановитьСерию(ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета));
	СерияРасходы.Цвет = ЦветаСтиля.ЦветРасходаВПроекте;
	
	Если ЭтоГод Тогда
		ДатаНачала = НачалоГода(Период);
		ДатаОкончания = КонецГода(Период);
	Иначе
		ДатаНачала = НачалоКвартала(Период);
		ДатаОкончания = КонецКвартала(Период);
	КонецЕсли;
	
	Пока НачалоМесяца(ДатаНачала) <= ДатаОкончания Цикл
		Точка = Гистограмма.УстановитьТочку(ФорматированнаяДатаПоМесяцу(ДатаНачала));
		Результат = ПолучитьДанныеЗаМесяц(ДатаНачала, МаксЗначениеШкалы, ВидФинансовогоОтчета);
		ДатаНачала = ДобавитьМесяц(ДатаНачала,1);
		Если Результат.МаксимальноеЗначение > МаксЗначениеШкалы Тогда
			МаксЗначениеШкалы = Результат.МаксимальноеЗначение;
		КонецЕсли;
		Гистограмма.УстановитьЗначение(Точка,СерияДоходы,Результат.Доход);
		Гистограмма.УстановитьЗначение(Точка,СерияРасходы,Результат.Расход);
	КонецЦикла;
	
	Гистограмма.ОсьЗначений.МаксимальноеЗначение = МаксЗначениеШкалы * 1.2;
	Гистограмма.ОсьЗначений.СпособОпределенияМаксимальногоЗначения =
		СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФорматированныйДоходИлиРасход(СуммаОперации, ЭтоДоход)
	
	ТекстТипаОперации = ?(ЭтоДоход, ПолучитьДоход() + ":", ПолучитьРасход() + ":");
	СуммаОперацииСтрокой = Формат(СуммаОперации, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(СуммаОперацииСтрокой, ",");
	
	ФорматРезультата = НСтр("ru = '<span style=""color : ТекстВторостепеннойНадписи"">%1 <a href=""ДоходыИРасходы"">%2<span style=""color : ТекстВторостепеннойНадписи; font : ШрифтДробнойЧастиДенегПодчеркнутый"">%3</span></a> <span style=""color : ТекстВторостепеннойНадписи"">%4</span>'");
	ФорматированныйТекст = СтроковыеФункции.ФорматированнаяСтрока(ФорматРезультата,ТекстТипаОперации,
		Лев(СуммаОперацииСтрокой, ПозицияРазделителя),Сред(СуммаОперацииСтрокой, ПозицияРазделителя+1),
		СимволВалюты());
	
	Возврат ФорматированныйТекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматированныеПоступленияИлиВыбытия(СуммаОперации, ЭтоПоступления)
	
	ТекстТипаОперации = ?(ЭтоПоступления, ПолучитьПоступления() + ":", ПолучитьВыбытия() + ":");
	СуммаОперацииСтрокой = Формат(СуммаОперации, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(СуммаОперацииСтрокой, ",");
	
	ФорматРезультата = НСтр("ru = '<span style=""color : ТекстВторостепеннойНадписи"">%1 <a href=""ДенежныйПоток"">%2<span style=""color : ТекстВторостепеннойНадписи; font : ШрифтДробнойЧастиДенегПодчеркнутый"">%3</span></a> <span style=""color : ТекстВторостепеннойНадписи"">%4</span>'");
	ФорматированныйТекст = СтроковыеФункции.ФорматированнаяСтрока(ФорматРезультата,ТекстТипаОперации,
		Лев(СуммаОперацииСтрокой, ПозицияРазделителя),Сред(СуммаОперацииСтрокой, ПозицияРазделителя+1),
		СимволВалюты());
	
	Возврат ФорматированныйТекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматированнаяРентабельность(СуммаДоходов, СуммаРасходов)
	
	Если СуммаДоходов > 0 Тогда
		ЗначениеРентабельности = Формат(((СуммаДоходов - СуммаРасходов) * 100)/СуммаДоходов,НСтр("ru= 'ЧДЦ=0; ЧФ=""Ч%""; ЧН='"));
	ИначеЕсли СуммаДоходов = 0 И СуммаРасходов = 0 Тогда
		ЗначениеРентабельности = ПолучитьНетДанных();
	ИначеЕсли СуммаРасходов > 0 И СуммаДоходов = 0 Тогда
		ЗначениеРентабельности = Формат(-100,НСтр("ru = 'ЧДЦ=0; ЧФ=""Ч%""'"));
	КонецЕсли;
	
	ФорматРезультата = НСтр("ru = '<span style=""color : ТекстВторостепеннойНадписи"">%1 <a href=""ДоходыИРасходы"">%2</a></span>'");
	ФорматированныйТекст = СтроковыеФункции.ФорматированнаяСтрока(ФорматРезультата,ПолучитьРентабельность(),ЗначениеРентабельности);
	
	Возврат ФорматированныйТекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматированнаяПрибыльИлиУбыток(СуммаДоходов, СуммаРасходов)
	
	РазностьСумм = СуммаДоходов - СуммаРасходов;
	РазностьСуммСтрокой = Формат(РазностьСумм, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(РазностьСуммСтрокой, ",");
	
	ТипОборота = ?(РазностьСумм > 0, ПолучитьПрибыльИлиУбыток(Истина), ПолучитьПрибыльИлиУбыток(Ложь));
	
	ФорматРезультата = НСтр("ru = '<span style=""color : ТекстВторостепеннойНадписи"">%1 <a href=""ДоходыИРасходы"">%2<span style=""color : ТекстВторостепеннойНадписи; font : ШрифтДробнойЧастиДенегПодчеркнутый"">%3</span></a> <span style=""color : ТекстВторостепеннойНадписи"">%4</span>'");
	ФорматированныйТекст = СтроковыеФункции.ФорматированнаяСтрока(ФорматРезультата,ТипОборота,Лев(РазностьСуммСтрокой, ПозицияРазделителя),
		Сред(РазностьСуммСтрокой, ПозицияРазделителя+1), СимволВалюты());
	
	Возврат ФорматированныйТекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматированныйЧистыйДенежныйПоток(СуммаДоходов, СуммаРасходов)
	
	РазностьСумм = СуммаДоходов - СуммаРасходов;
	РазностьСуммСтрокой = Формат(РазностьСумм, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(РазностьСуммСтрокой, ",");
	
	ТипОборота = ПолучитьЧистыйДенежныйПоток();
	
	ФорматРезультата = НСтр("ru = '<span style=""color : ТекстВторостепеннойНадписи"">%1 <a href=""ДенежныйПоток"">%2<span style=""color : ТекстВторостепеннойНадписи; font : ШрифтДробнойЧастиДенегПодчеркнутый"">%3</span></a> <span style=""color : ТекстВторостепеннойНадписи"">%4</span>'");
	ФорматированныйТекст = СтроковыеФункции.ФорматированнаяСтрока(ФорматРезультата,ТипОборота,Лев(РазностьСуммСтрокой, ПозицияРазделителя),
		Сред(РазностьСуммСтрокой, ПозицияРазделителя+1), СимволВалюты());
	
	Возврат ФорматированныйТекст;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматированнаяДатаПоМесяцу(ТекДата)
	
	ДатаДляФорматирования = Формат(ТекДата,НСтр("ru = 'ДФ=''ММММ гг'''"));
	Месяц = Лев(ДатаДляФорматирования, 3);
	Год = Прав(ДатаДляФорматирования, 2);
	Возврат СтрШаблон("%1 %2", Месяц, Год);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматированнаяДатаПоКварталу(ТекДата)
	
	ЭлементыДаты = СтрРазделить(Формат(ТекДата, НСтр("ru = 'ДФ=''к гггг'''")), " ", Ложь);
	ФорматированнаяДата = СтрШаблон("%1 %2 %3", ЭлементыДаты[0], НСтр("ru= 'квартал'"), ЭлементыДаты[1]);
	Возврат ФорматированнаяДата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматированнаяДатаПоГоду(ТекДата)
	
	Возврат СтрЗаменить(Строка(Год(ТекДата)), Символы.НПП, "");
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда	
		Возврат ПолучитьДоходыИРасходы();
	Иначе
		Возврат ПолучитьДенежныйПоток();
	КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоходИлиПоступления(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда	
		Возврат ПолучитьДоход();
	Иначе
		Возврат ПолучитьПоступления();
	КонецЕсли
	
КонецФункции    

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРасходИлиВыбытия(ВидФинансовогоОтчета)
	
	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда	
		Возврат ПолучитьРасход();
	Иначе
		Возврат ПолучитьВыбытия();
	КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЦветНетДанных(ЭтоТемный)
	
	Если ЭтоТемный Тогда
		Возврат Новый Цвет(180,180,180);
	Иначе
		Возврат Новый Цвет(200,200,200);
	КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНетДанных()
	
	Возврат НСтр("ru='Нет данных'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРентабельность() 
	
	Возврат НСтр("ru='Рентабельность:'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПрибыльИлиУбыток(ЭтоПрибыль)
	
	Возврат ?(ЭтоПрибыль, НСтр("ru = 'Прибыль:'"), НСтр("ru = 'Убыток:'"));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоход()
	
	Возврат НСтр("ru = 'Доход'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРасход()
	
	Возврат НСтр("ru = 'Расход'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоходыИРасходы()
	
	Возврат НСтр("ru = 'ДОХОДЫ И РАСХОДЫ'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПоступления()
	
	Возврат НСтр("ru = 'Поступления'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВыбытия()
	
	Возврат НСтр("ru = 'Выбытия'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДенежныйПоток()
	
	Возврат НСтр("ru = 'ДЕНЕЖНЫЙ ПОТОК'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЧистыйДенежныйПоток()
	
	Возврат НСтр("ru = 'Чистый денежный поток:'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоМесяцевМеждуДатами(ДатаНачала, ДатаОкончания)
	
	МесяцНачала = Месяц(ДатаНачала);
	МесяцОкончания = Месяц(ДатаОкончания);
	ГодовМеждуДатами = Год(ДатаОкончания) - Год(ДатаНачала);
	Возврат МесяцОкончания - МесяцНачала + ГодовМеждуДатами * 12;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуНачала(ДатаНачалаИзДокумента, АктивнаяТаблица = Неопределено) 
	
	Если ЗначениеЗаполнено(ДатаНачалаИзДокумента) Тогда
		ДатаНачала = ДатаНачалаИзДокумента;
	Иначе
		Если ЗначениеЗаполнено(АктивнаяТаблица) Тогда
			Документ = АктивнаяТаблица.Получить(0);
			ДатаНачала = Документ.Период;
		Иначе
			Возврат '00010101';
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаНачала; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуОкончания(ДатаОкончанияИзДокумента, ТекДатаСеанса = Неопределено, АктивнаяТаблица = Неопределено)
	
	Если ЗначениеЗаполнено(ДатаОкончанияИзДокумента) Тогда
		ДатаОкончания = ДатаОкончанияИзДокумента;
	Иначе
		Если ЗначениеЗаполнено(АктивнаяТаблица) Тогда
			Документ = АктивнаяТаблица.Получить(АктивнаяТаблица.Количество() - 1);
			ДатаОкончания = Документ.Период;
		Иначе
			Возврат ТекДатаСеанса;
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаОкончания;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта)
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

&НаКлиенте
Процедура ПерейтиКОтчету()

	Если ВидФинансовогоОтчета = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхОтчетов.ДоходыРасходы") Тогда 
		КольцеваяДиаграмма = КольцеваяДиаграммаДР;
		АктивнаяТаблица = ДоходыИРасходы; 
		СписокДатИзГистограммы = СписокДатИзГистограммыДР;
		Вариант = СсылкаВариантаОтчета("ДоходыИРасходы", "ДоходыИРасходыПоПроектам");		
	Иначе            
		КольцеваяДиаграмма = КольцеваяДиаграммаДП;       
		АктивнаяТаблица = ДенежныйПоток;    
		СписокДатИзГистограммы = СписокДатИзГистограммыДП;
		Вариант = СсылкаВариантаОтчета("ДвижениеДенежныхСредствПоПроектам", "ДвижениеДенежныхСредствПоПроектам");		
	КонецЕсли;      

	Период = Новый СтандартныйПериод;
	ОтборРасшифровки = Новый Структура;
	ОтборРасшифровки.Вставить("Проект", Объект.Ссылка);
	
	Если КольцеваяДиаграмма.ОбластьЗаголовка.Текст = ПолучитьЗаголовокДиаграммы(ВидФинансовогоОтчета) Тогда
		Период.ДатаНачала = ПолучитьДатуНачала(Объект.ДатаНачала, АктивнаяТаблица);
		Период.ДатаОкончания = КонецМесяца(ПолучитьДатуОкончания(Объект.ДатаОкончания, ОбщегоНазначенияКлиент.ДатаСеанса(), АктивнаяТаблица));
	Иначе
		Индекс = СписокДатИзГистограммы.Количество() - 1;
		ДатаИзГистограммы = СписокДатИзГистограммы[Индекс].Значение;
		Период.ДатаНачала = НачалоМесяца(ДатаИзГистограммы);
		Период.ДатаОкончания = КонецМесяца(ДатаИзГистограммы);
	КонецЕсли;
	ОтборРасшифровки.Вставить("СтПериод", Период);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ОтборРасшифровки); 
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СимволВалюты()
	
	ВалютаУчета = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();
	
	СимволВалюты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВалютаУчета, "СимвольноеПредставление");
	Если НЕ ЗначениеЗаполнено(СокрЛП(СимволВалюты)) Тогда
		СимволВалюты = Строка(ВалютаУчета);
	КонецЕсли;
	
	Возврат СимволВалюты;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект); 
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
